## Employee Bonus

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from config import db_user, db_pwd
# SQL Alchemy
from sqlalchemy import create_engine

In [2]:
# Create Engine for data
engine = create_engine(f"postgresql://{db_user}:{db_pwd}@localhost/employee_db")
conn = engine.connect()

In [3]:
# Query all records in the salaries table
salaries_data = pd.read_sql('SELECT * FROM salaries', conn)
salaries_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [4]:
# Query all records in the titles table
titles_data = pd.read_sql('SELECT * FROM titles', conn)
titles_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer